{"text1": "### Human: I got really angry when my coworker interrupted me during a meeting.", "text2": "### Assistant: Can you identify the specific thoughts you had when your coworker interrupted you? What did you believe about yourself or the situation at that moment?"}
{"text1": "### Human: I lost my temper when I was stuck in traffic for hours.", "text2": "### Assistant: What evidence do you have that this traffic situation is truly unbearable? Is there a different way to view this situation that might help you feel less angry?"}
{"text1": "### Human: I yelled at my partner because they forgot to pick up the groceries.", "text2": "### Assistant: Is it accurate to say that forgetting the groceries means they don’t care about you? Can you reframe this situation in a more balanced way?"}
{"text1": "### Human: I get furious when I see people cutting in line.", "text2": "### Assistant: Let's try a small experiment. Next time you see someone cut in line, take a deep breath and count to ten before reacting. How did that change the outcome?"}
{"text1": "### Human: I can't control my anger when my kids make a mess at home.", "text2": "### Assistant: This pattern suggests a deeper belief about control and order. What might that underlying belief be? How can you address it more constructively?"}
{"text1": "### Human: I get angry when people don't respond to my messages promptly", "text2": "### Assistant: What assumptions are you making about why they haven't responded? Could there be other reasons for the delay that don't involve them disregarding you?"}
{"text1": "### Human: I feel like exploding when my boss criticizes my work.", "text2": "### Assistant: Is it accurate to believe that criticism means you're not good at your job? Can you view the feedback as a way to improve rather than a personal attack?"}
{"text1": "### Human: I get furious when drivers cut me off on the road.", "text2": "### Assistant: What thoughts go through your mind when this happens? Can you reframe the situation by considering that the other driver might have made a mistake or be in a hurry for an emergency?"}
{"text1": "### Human: I can't control my anger when people are rude to me in public.", "text2": "### Assistant: Can you think of alternative ways to respond to rudeness? Perhaps reminding yourself that their behavior reflects on them, not you, and trying to stay calm?"}
{"text1": "### Human: I get angry when my partner doesn't listen to me.", "text2": "### Assistant: What specific thoughts do you have in that moment? Can you express your feelings to your partner in a way that encourages understanding rather than conflict?"}
{"text1": "### Human: I lose my temper when my plans get disrupted.", "text2": "### Assistant: Is it realistic to expect everything to go according to plan? How can you develop flexibility and adapt to changes without feeling overwhelmed by anger?"}
{"text1": "### Human: I feel enraged when people don't appreciate my efforts.", "text2": "### Assistant: What evidence do you have that people don't appreciate you? Can you find instances where your efforts have been recognized, even if not immediately?"}
{"text1": "### Human: I get mad when my friends cancel plans at the last minute.", "text2": "### Assistant: What thoughts go through your mind when this happens? Could there be other reasons for the cancellations that are not about you personally?"}
{"text1": "### Human: I feel anger boiling up when I'm accused of something I didn't do.", "text2": "### Assistant: What specific thoughts are fueling your anger in that situation? How can you calmly and assertively communicate your perspective without escalating the conflict?"}
{"text1": "### Human: I get angry when my team members don't meet their deadlines.", "text2": "### Assistant: What specific thoughts are you having about their missed deadlines? Can you reframe the situation by considering potential obstacles they might be facing?"}
{"text1": "### Human: I can't stand it when people talk over me in conversations.", "text2": "### Assistant: What assumptions are you making about their behavior? Could there be other reasons for their interruptions that don't involve them disrespecting you?"}
{"text1": "### Human: I get furious when someone spreads rumors about me.", "text2": "### Assistant: What evidence do you have that the rumors are true or significant? How can you address this situation calmly and assertively to protect your reputation?"}
{"text1": "### Human: I feel enraged when my family doesn't support my decisions.", "text2": "### Assistant: Is it realistic to expect everyone to agree with you all the time? How can you find a balance between seeking support and maintaining your own autonomy?"}
{"text1": "### Human: I get angry when my friends are late to meet me.", "text2": "### Assistant: What thoughts go through your mind when this happens? Can you reframe the situation by considering that delays might be unavoidable for them?"}
{"text1": "### Human: I lose my temper when my computer crashes.", "text2": "### Assistant: Is it helpful to get angry at an inanimate object? How can you develop a more constructive approach to dealing with technical difficulties?"}
{"text1": "### Human: I feel furious when people don't follow the rules.", "text2": "### Assistant: What specific thoughts are driving your anger in this situation? Can you reframe your perspective to focus on what you can control?"}
{"text1": "### Human: I get mad when my siblings don't respect my boundaries.", "text2": "### Assistant: Can you express your feelings to your siblings in a way that encourages understanding and respect for your boundaries?"}
{"text1": "### Human: I feel anger rising when my partner doesn't remember important dates.", "text2": "### Assistant: Is it fair to expect perfect memory from your partner? How can you communicate your feelings and find ways to remind each other of important dates?"}
{"text1": "### Human: I get frustrated when my internet connection is slow.", "text2": "### Assistant: What thoughts go through your mind when this happens? Can you develop strategies to cope with the inconvenience without feeling overwhelmed by anger?"}
{"text1": "### Human: I feel enraged when people don't listen to my suggestions at work.", "text2": "### Assistant: Is it accurate to believe that your suggestions are being ignored on purpose? How can you communicate your ideas more effectively and seek feedback?"}
{"text1": "### Human: I get mad when my partner doesn't clean up after themselves.", "text2": "### Assistant: What specific thoughts are fueling your anger in this situation? Can you address the issue with your partner in a constructive and respectful way?"}
{"text1": "### Human: I feel furious when people judge me without knowing the full story.", "text2": "### Assistant: What evidence do you have that their judgment is accurate? How can you address the situation calmly and assertively to clarify misunderstandings?"}
{"text1": "### Human: I lose my temper when my plans get interrupted.", "text2": "### Assistant: Is it realistic to expect everything to go according to plan? How can you develop flexibility and adapt to changes without feeling overwhelmed by anger?"}
{"text1": "### Human: I get angry when my friends don't keep their promises.", "text2": "### Assistant: What specific thoughts are driving your anger in this situation? Can you express your feelings to your friends in a way that encourages honesty and reliability?"}
{"text1": "### Human: I feel enraged when people don't acknowledge my achievements.", "text2": "### Assistant: What evidence do you have that your achievements are being ignored? Can you find instances where your efforts have been recognized, even if not immediately?"}
{"text1": "### Human: I get mad when my partner doesn't pay attention to me.", "text2": "### Assistant: What specific thoughts are fueling your anger in this situation? Can you communicate your needs to your partner in a constructive and respectful way?"}
{"text1": "### Human: I feel anger rising when I'm blamed for things I didn't do.", "text2": "### Assistant: What specific thoughts are driving your anger in this situation? How can you calmly and assertively communicate your perspective without escalating the conflict?"}
{"text1": "### Human: I get frustrated when my parents criticize my choices.", "text2": "### Assistant: Is it accurate to believe that their criticism means they don't care about you? How can you reframe the situation and communicate your feelings to your parents constructively?"}
{"text1": "### Human: I feel enraged when people don't respect my space.", "text2": "### Assistant: What specific thoughts are fueling your anger in this situation? Can you set boundaries and communicate your needs to others in a respectful way?"}
{"text1": "### Human: I get angry when people talk loudly on their phones in public.", "text2": "### Assistant: What thoughts go through your mind when this happens? Can you reframe the situation by considering that they might not realize how loud they are being?"}
{"text1": "### Human: I feel enraged when someone doesn't take responsibility for their actions.", "text2": "### Assistant: Is it realistic to expect everyone to behave the way you want them to? How can you focus on what you can control and respond constructively?"}
{"text1": "### Human: I get frustrated when my team doesn't follow my instructions.", "text2": "### Assistant: What specific thoughts are fueling your anger in this situation? Can you find ways to communicate your expectations more clearly and effectively?"}
{"text1": "### Human: I feel anger rising when I'm ignored in group discussions.", "text2": "### Assistant: What assumptions are you making about why you're being ignored? Can you assertively express your ideas and seek feedback?"}
{"text1": "### Human: I get mad when people make fun of my opinions.", "text2": "### Assistant: Is it accurate to believe that their mockery diminishes your worth? How can you stand firm in your beliefs while addressing the situation calmly?"}
{"text1": "### Human: I feel furious when my efforts go unrecognized at work.", "text2": "### Assistant: What evidence do you have that your efforts are truly unnoticed? Can you find other ways to seek recognition or take pride in your achievements?"}
{"text1": "### Human: I get angry when my partner disagrees with me.", "text2": "### Assistant: Is it realistic to expect complete agreement on everything? How can you communicate your perspectives respectfully and find common ground?"}
{"text1": "### Human: I feel enraged when people break promises.", "text2": "### Assistant: What specific thoughts are driving your anger in this situation? How can you address the issue and express your feelings constructively?"}
{"text1": "### Human: I get mad when my coworkers don't pull their weight.", "text2": "### Assistant: What specific thoughts are fueling your anger in this situation? Can you communicate your concerns to your coworkers and find ways to work more collaboratively?"}
{"text1": "### Human: I feel anger rising when I'm blamed for others' mistakes.", "text2": "### Assistant: What specific thoughts are driving your anger in this situation? How can you calmly and assertively communicate your perspective without escalating the conflict?"}
{"text1": "### Human: I get frustrated when people don't follow through on their commitments.", "text2": "### Assistant: What specific thoughts are driving your frustration? Can you address the issue with the person involved and express your needs constructively?"}
{"text1": "### Human: I feel enraged when I'm misunderstood.", "text2": "### Assistant: Is it realistic to expect everyone to always understand you perfectly? How can you clarify your perspective and ensure better communication?"}
{"text1": "### Human: I get angry when my ideas are dismissed without consideration.", "text2": "### Assistant: What evidence do you have that your ideas are being dismissed intentionally? Can you present your ideas more clearly and seek constructive feedback?"}
{"text1": "### Human: I feel furious when my friends don't show up on time.", "text2": "### Assistant: What specific thoughts are fueling your anger in this situation? Can you reframe the situation by considering possible reasons for their delay?"}
{"text1": "### Human: I get mad when people don't take me seriously.", "text2": "### Assistant: Is it accurate to believe that their behavior reflects your worth? How can you assertively express your thoughts and demonstrate your value?"}
{"text1": "### Human: I feel enraged when my partner makes decisions without consulting me.", "text2": "### Assistant: What specific thoughts are driving your anger in this situation? Can you communicate your expectations and work together to make decisions collaboratively?"}
{"text1": "### Human: I get frustrated when people don't keep their promises.", "text2": "### Assistant: What evidence do you have that they never keep their promises? How can you address the issue and express your feelings constructively?"}
{"text1": "### Human: I feel angry when I'm criticized unfairly.", "text2": "### Assistant: What assumptions are you making about the criticism? Can you reframe the situation by considering constructive feedback and addressing any misunderstandings?"}
{"text1": "### Human: I get mad when my coworkers don't listen to my ideas.", "text2": "### Assistant: What specific thoughts are fueling your anger in this situation? Can you find ways to communicate your ideas more effectively and seek feedback?"}
{"text1": "### Human: I feel anger rising when people disrespect my opinions.", "text2": "### Assistant: What evidence do you have that they are intentionally disrespecting you? How can you express your opinions assertively and seek mutual respect?"}
{"text1": "### Human: I get angry when my friends don't invite me to hang out.", "text2": "### Assistant: What thoughts are triggering your anger in this situation? Can you consider other reasons for the lack of invitation and address your feelings with your friends?"}
{"text1": "### Human: I feel enraged when my ideas are not taken seriously.", "text2": "### Assistant: Is it possible that people are focused on other matters at the moment? How can you ensure your ideas are presented clearly and receive proper consideration?"}
{"text1": "### Human: I get frustrated when my efforts are overlooked.", "text2": "### Assistant: What assumptions are you making about why your efforts are not recognized? How can you seek constructive feedback and find ways to highlight your contributions?"}
{"text1": "### Human: I feel angry when people interrupt me mid-sentence.", "text2": "### Assistant: What specific thoughts are fueling your anger in this situation? Can you calmly assert your need to be heard and encourage respectful conversation?"}
{"text1": "### Human: I get mad when my partner doesn't make time for me.", "text2": "### Assistant: Is it realistic to expect them to always be available? How can you communicate your needs and find a balance that works for both of you?"}
{"text1": "### Human: I feel enraged when my siblings invade my privacy.", "text2": "### Assistant: What specific thoughts are driving your anger in this situation? Can you set clear boundaries and communicate your need for privacy respectfully?"}
{"text1": "### Human: I get frustrated when I'm criticized for my appearance.", "text2": "### Assistant: Is it helpful to take others' comments personally? How can you reframe the situation and focus on your self-worth?"}
{"text1": "### Human: I feel angry when my opinions are dismissed in meetings.", "text2": "### Assistant: What assumptions are you making about why your opinions are dismissed? How can you assert your ideas and seek constructive dialogue?"}
{"text1": "### Human: I get mad when people don't appreciate my hard work.", "text2": "### Assistant: What evidence do you have that your hard work is truly unnoticed? Can you seek feedback and find ways to highlight your contributions?"}
{"text1": "### Human: I feel enraged when people judge me without knowing me.", "text2": "### Assistant: Is it realistic to expect everyone to understand you fully? How can you address the situation calmly and assertively to clarify misunderstandings?"}
{"text1": "### Human: I get angry when my friends cancel plans at the last minute.", "text2": "### Assistant: What thoughts go through your mind when this happens? Can you reframe the situation by considering that their cancellation might be due to unforeseen circumstances?"}
{"text1": "### Human: I feel enraged when people criticize my lifestyle choices.", "text2": "### Assistant: Is it realistic to expect everyone to agree with your choices? How can you respond to criticism constructively while staying true to yourself?"}
{"text1": "### Human: I get frustrated when my boss micromanages me.", "text2": "### Assistant: What specific thoughts are driving your frustration? How can you communicate your desire for more autonomy in a respectful manner?"}
{"text1": "### Human: I feel angry when my partner doesn't understand my feelings.", "text2": "### Assistant: What assumptions are you making about their ability to understand you? How can you express your feelings more clearly to foster better communication?"}
{"text1": "### Human: I get mad when people don't follow through on their promises.", "text2": "### Assistant: What evidence do you have that they never keep their promises? Can you address the issue with them and express your feelings constructively?"}
{"text1": "### Human: I feel enraged when my parents criticize my career choices.", "text2": "### Assistant: What specific thoughts are fueling your anger in this situation? Can you reframe the criticism as concern and communicate your perspective?"}
{"text1": "### Human: I get frustrated when people don't respect my opinions.", "text2": "### Assistant: Is it realistic to expect complete agreement from everyone? How can you express your opinions assertively and seek mutual respect?"}
{"text1": "### Human: I feel angry when my efforts go unrecognized.", "text2": "### Assistant: What assumptions are you making about why your efforts are unnoticed? How can you seek constructive feedback and find ways to highlight your contributions?"}
{"text1": "### Human: I get mad when my friends don't include me in their plans.", "text2": "### Assistant: What specific thoughts are driving your anger in this situation? Can you address your feelings with your friends and seek understanding?"}
{"text1": "### Human: I feel enraged when my siblings don't respect my boundaries.", "text2": "### Assistant: What specific thoughts are fueling your anger in this situation? Can you set clear boundaries and communicate your need for privacy respectfully?"}
{"text1": "### Human: I get frustrated when my partner doesn't make time for me.", "text2": "### Assistant: Is it realistic to expect them to always be available? How can you communicate your needs and find a balance that works for both of you?"}
{"text1": "### Human: I feel angry when people talk loudly in public places.", "text2": "### Assistant: What specific thoughts are driving your anger in this situation? Can you reframe the situation by considering that they might not realize how loud they are being?"}
{"text1": "### Human: I get mad when my coworkers don't listen to my ideas.", "text2": "### Assistant: What assumptions are you making about why they aren't listening? How can you assertively present your ideas and seek constructive dialogue?"}
{"text1": "### Human: I feel enraged when people dismiss my achievements.", "text2": "### Assistant: Is it realistic to expect constant recognition from others? How can you find value in your achievements and seek constructive feedback?"}
{"text1": "### Human: I get frustrated when my partner doesn't help with household chores.", "text2": "### Assistant: What specific thoughts are driving your frustration? Can you communicate your expectations and find ways to share responsibilities?"}
{"text1": "### Human: I feel angry when people judge me based on my appearance.", "text2": "### Assistant: Is it helpful to take others' judgments personally? How can you reframe the situation and focus on your self-worth?"}
{"text1": "### Human: I get mad when my friends don't keep their commitments.", "text2": "### Assistant: What specific thoughts are driving your anger in this situation? Can you address the issue with your friends and seek understanding?"}
{"text1": "### Human: I feel enraged when people don't respect my personal space.", "text2": "### Assistant: What specific thoughts are fueling your anger in this situation? Can you set clear boundaries and communicate your need for privacy respectfully?"}
{"text1": "### Human: I get frustrated when my efforts are overlooked.", "text2": "### Assistant: What assumptions are you making about why your efforts are unnoticed? How can you seek constructive feedback and find ways to highlight your contributions?"}
{"text1": "### Human: I feel angry when my partner doesn't understand my needs.", "text2": "### Assistant: What assumptions are you making about their ability to understand you? How can you express your needs more clearly to foster better communication?"}
{"text1": "### Human: I get frustrated when people interrupt me while I'm speaking.", "text2": "### Assistant: What thoughts go through your mind when this happens? Can you address the interruptions by calmly expressing your need to be heard?"}
{"text1": "### Human: I feel enraged when my partner forgets important dates.", "text2": "### Assistant: Is it realistic to expect perfect memory from your partner? How can you remind each other of important dates and communicate your feelings?"}
{"text1": "### Human: I get angry when my parents compare me to my siblings.", "text2": "### Assistant: What assumptions are you making about their comparisons? How can you address the issue by communicating your feelings and focusing on your unique strengths?"}
{"text1": "### Human: I feel frustrated when people don't appreciate my sense of humor.", "text2": "### Assistant: Is it realistic to expect everyone to share your sense of humor? How can you enjoy your humor while accepting that others might have different tastes?"}
{"text1": "### Human: I get mad when my partner spends too much time on their phone.", "text2": "### Assistant: What specific thoughts are driving your anger in this situation? Can you communicate your desire for more quality time together and find a balance?"}
{"text1": "### Human: I feel enraged when people don't take my advice.", "text2": "### Assistant: Is it realistic to expect everyone to follow your advice? How can you offer your perspective without feeling personally responsible for their choices?"}
{"text1": "### Human: I get frustrated when my friends ignore my messages.", "text2": "### Assistant: What assumptions are you making about why they haven't responded? Can you consider other reasons for the delay and address your feelings with your friends?"}
{"text1": "### Human: I feel angry when my coworkers take credit for my work.", "text2": "### Assistant: What specific thoughts are fueling your anger in this situation? Can you address the issue with your coworkers and seek recognition for your contributions?"}
{"text1": "### Human: I get mad when my partner doesn't help with parenting duties.", "text2": "### Assistant: Is it realistic to expect equal involvement at all times? How can you communicate your expectations and find ways to share responsibilities?"}
{"text1": "### Human: I feel frustrated when people judge my decisions.", "text2": "### Assistant: What assumptions are you making about their judgments? How can you reframe the situation and focus on making decisions that are right for you?"}
{"text1": "### Human: I get angry when my friends don't support my goals.", "text2": "### Assistant: Is it fair to expect complete support from everyone? How can you seek support from those who understand your goals and focus on your own motivation?"}
{"text1": "### Human: I feel enraged when people underestimate my abilities", "text2": "### Assistant: What specific thoughts are driving your anger in this situation? How can you demonstrate your abilities and address any misconceptions?"}
{"text1": "### Human: I get frustrated when my partner doesn't prioritize our relationship.", "text2": "### Assistant: What assumptions are you making about their priorities? How can you communicate your needs and find ways to strengthen your relationship?"}
{"text1": "### Human: I feel angry when people make assumptions about me.", "text2": "### Assistant: Is it realistic to expect everyone to understand you fully? How can you address the situation calmly and assertively to clarify misunderstandings?"}
{"text1": "### Human: I get mad when my efforts are not acknowledged.", "text2": "### Assistant: What evidence do you have that your efforts are truly unnoticed? Can you seek constructive feedback and find ways to highlight your contributions?"}
{"text1": "### Human: I'm so fed up with my boss! They never appreciate my hard work.", "text2": "### Assistant: I hear you. It's frustrating when your efforts go unnoticed. What exactly did your boss do this time? Let's break it down."}
{"text1": "### Human: Why does everything always go wrong for me? I'm so angry!", "text2": "### Assistant: It sounds like you're dealing with a lot right now. Can you tell me about a specific situation that went wrong? Let's figure out what's really going on."}
